import UIKit

var greeting = "Hello, playground"
//Homework
//У нас есть семья: папа, мама и дети
//Папа глава семьи, у него есть мама, мама контролирует детей
// дети могут вызывать друг друга (у детей есть ссылки на других детей) (ну не ссылки), они могут искать пути как взаимодействовать друг с другом, общаться с другими детьми, например говорить: "дай мне игрушку"
// дети могут спрашивать маму: "мама, дай конфетку" - должна быть какая-то двусторонняя связь
// дети могут говорить папе: "папа, дай мне игрушку" - т.е. у них есть еще доступ к папе
// и вся эта иерархия лежит в объекте класса семья
// у класса семья есть метод - распечатать всю семью - вернет массив всех членов семьи
// все могут общаться друг с другом.
// У папы есть еще 3 клоужера:
// 1) он говорит семье: распечатать всю семью
// 2) второй клоужер говорит: распечатай маму
// 3) третий клоужер говорит: распечатай всех детей
// сделайте всю эту иерархию, со всеми этими связями, ну вот используйтей Command line two (что бы не в плейграунде, а в проекте, как в уроке), для того чтобы: создать все эти объекты, а потом самое главное, когда мы выйдем из зоны видимости конечно же всё должно быть уничтожено само собой

var play = true

if play {
    
    
    
    
}
